In [10]:
import pandas as pd

In [11]:
#dataset
data={
    "Student":["Amit","Jhon","Kapil","Mukund","Sachin"],
    "Rank":[1,4,3,5,2],
    "Marks":[90,70,80,60,90]
     }

In [12]:
df=pd.DataFrame(data)
df

  Student  Rank  Marks
0    Amit     1     90
1    Jhon     4     70
2   Kapil     3     80
3  Mukund     5     60
4  Sachin     2     90